[
    {
        "dish_name": "Couscous",
        "img_url": "https://www.thespruceeats.com/thmb/EE7_vn_dAczi1Z1sF3L_w3QGDRw=/3890x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/couscous-getty-3890-x-2562-56a645de5f9b58b7d0e0c3b1.jpg",
        "description": "Couscous is prepared weekly in many Moroccan homes and the presentation pictured here, couscous with seven vegetables, is one of the most popular versions. Lamb, beef, or chicken is stewed along with a variety of vegetables, then arranged on a glorious heap of tender, steamed couscous grains. As with many other Moroccan dishes, everyone gathers round to eat from one super-sized communal plate."
    },
    {
        "dish_name": "Moroccan Chicken Bastilla",
        "img_url": "https://www.thespruceeats.com/thmb/_iEBB6FaF5wtCmLumpKS0jE6qY0=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/bastilla-chicken-1500-x-1000-56a6446e3df78cf7728c2e32.jpg",
        "description": "Moroccan chicken bastilla is Morocco's famous rendition of a savory pie, and it simply doesn't get better than this. Traditionally pigeons were the birds of choice, but here chicken is cooked with saffron, ginger, pepper, and cinnamon, then layered within crispy warqa pastry with an herb-laden omelet and fried almonds scented with orange flower water. An utterly amazing fusion of flavors and textures."
    },
    {
        "dish_name": "Tagine",
        "img_url": "https://www.thespruceeats.com/thmb/763faUlUREH1mp7Z3qSbI9BPw6Q=/2718x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/berber-tagine-1-2718-x-1800-57c500575f9b5855e537715c.jpg",
        "description": "The sky's the limit when it comes to tagine, the famous slow-cooked Moroccan stew that takes its name from the traditional clay or ceramic dish it's traditionally cooked in. Shown here is a Berber tagine with meat and vegetables. It's arranged in conical fashion and left undisturbed to cook until tender, making a delicious, beautiful presentation. Tagines are traditionally eaten directly from the cooking vessel, using pieces of Moroccan bread (khobz) to scoop up meat, veggies, and sauce."
    },
    {
        "dish_name": "Chicken With Preserved Lemon and Olives",
        "img_url": "https://www.thespruceeats.com/thmb/gFpvqyqi5Xucdu_j2cQSVKd_K1A=/2040x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Roasted-Chicken-3264-x-2448-56a644a65f9b58b7d0e0c110.jpg",
        "description": "This classic, versatile dish is also one of Morocco's most famous and ubiquitous. And no wonder. It's utterly delicious and works beautifully for any occasion ranging from casual family dinners to celebratory banquets. You'll find it offered in homes, restaurants, and even on the street in tiny outdoor dining venues. Shown here is a roasted chicken with preserved lemons and olives presentation, but the dish is also easily prepared in a traditional tagine or conventional pot. Lots of onions are cooked to a puree-like consistency with saffron and ginger; preserved lemons and olives are tangy additions to finish the dish."
    },
    {
        "dish_name": "Lamb or Beef With Prunes",
        "img_url": "https://www.thespruceeats.com/thmb/jfFA1h3lT3P8Whq2AeARLvAiQ9k=/2460x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Tagine-Of-Beef-and-Prunes-2592-x-1944-56a6454c3df78cf7728c305c.jpg",
        "description": "Even if you don't normally reach for prunes when grocery shopping, don't be put off by this particular combination of sweet and savory. Your palate will be well rewarded for venturing into new Moroccan territory with this lamb or beef with prunes recipe. The meat is cooked until buttery tender with saffron, ginger, and onions, then topped with prunes that have been poached in syrup with cinnamon and honey. Crunchy fried almonds serve as a garnish. Still not convinced? Then maybe you'd rather try another classic Moroccan dried fruit tagine, chicken with apricots."
    },
    {
        "dish_name": "Kefta Meatball Tagine",
        "img_url": "https://www.thespruceeats.com/thmb/CdZdpgxPZG18-bVHRfe05qo5nVI=/2290x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Kefta_Mkaouara-2_J_Gilman-56a644623df78cf7728c2de3.jpg",
        "description": "Moroccans like to heartily season their ground beef or lamb (kefta) with cumin, paprika, and herbs. In its simplest form, the spiced kefta is shaped and then grilled or pan-fried, but you'll also find kefta used extensively in other dishes, such as this popular meatball tagine with poached eggs. Despite the ample tomato sauce, no pasta is required, but you will want some Moroccan bread to use in lieu of a fork. Moroccan kefta recipes will give you other ideas of how Moroccans have creatively transformed ground meat from boring to fabulous."
    },
    {
        "dish_name": "Rfisa",
        "img_url": "https://www.thespruceeats.com/thmb/wb5vMldFDM8HLE-4Tr2qQoJZM8U=/3153x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/Rfissa-3264-x-2176-56a644a75f9b58b7d0e0c113.jpg",
        "description": "There may be nothing elegant about pouring hot meat and broth over a plateful of bread, yet around the world such humble fare is regarded as savory, satisfying comfort food at its best. In Morocco, it takes the form of rfissa, a spectacular presentation of stewed chicken and lentils fragrantly seasoned with fenugreek, saffron, and ras el hanout. The dish is famously served to new mothers, but it's also a popular specialty dish to offer to family or guests on other occasions."
    },
    {
        "dish_name": "Harira",
        "img_url": "https://www.thespruceeats.com/thmb/3schF4k7s7WqNMN-rAIaJSPLAAA=/1500x0/filters:no_upscale():max_bytes(150000):strip_icc():format(webp)/classic-moroccan-harira-soup-2394920.Hero-5b6b411546e0fb0050483664.jpg",
        "description": "You'll find all kinds of soups served in Moroccan homes and restaurants, but this one stands out from the crowd for being uniquely Moroccan and very much loved throughout the country. Variations are countless, but typically harira is a tomato-based soup laden with lentils and chickpeas. Rice or fine broken noodles (chaariya) are often added as well, while the stock is usually made with beef or lamb. This authentic harira recipe does not fall into the quick and easy category, but the effort to make it won't disappoint."
    }
]